Revit 2024 API
FabricationPart.ProductInstallType Property
 The product install type of the fabrication part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public string ProductInstallType { get; }
Visual Basic
Public ReadOnly Property ProductInstallType As String
	Get
Visual C++
public:
property String^ ProductInstallType {
	String^ get ();
}
See Also
FabricationPart Class
Autodesk.Revit.DB Namespace